{
  "base_model_name_or_path": "internlm/internlm2-1_8b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "revision": null,
  "target_modules": [
    "w3",
    "output",
    "w1",
    "w2",
    "wqkv",
    "wo"
  ],
  "task_type": "CAUSAL_LM"
}